docs/results/chaos-redis-k6.txt
CHAOS RUN (docs/08 S3-06): `docker compose stop redis` at t=10 s, `docker compose start redis` at t=20 s.
Outcome: status_5xx = 0, degraded_responses = 1113 (X-RateLimit-Degraded during the outage), checks 100 %,
Redis reconnected ~1 s after restart and limits were enforced again immediately.
The status_429 threshold is expected to fail here: during the outage the limiter fails open by design,
so fewer requests are rejected than the closed-form estimate assumes.

OmniGate rate-limit load test - 2026-09-07T20:27:36.343Z
target http://host.docker.internal:8080/api/orders/items | 100 rps x 40s | 20 principals x 100 req/window
expected 429s: 2000 (±80)
     ✓ status is 2xx or 429
     ✓ has X-Request-Id
     ✓ rate-limit headers present
     ✓ 429 carries Retry-After

   ✓ checks.........................: 100.00% ✓ 16004      ✗ 0    
     data_received..................: 2.0 MB  49 kB/s
     data_sent......................: 1.2 MB  30 kB/s
     degraded_responses.............: 1113    27.817108/s
     http_req_blocked...............: avg=26.52µs min=1.33µs   med=3.45µs  max=9.96ms   p(90)=17µs    p(95)=20.41µs 
     http_req_connecting............: avg=19.1µs  min=0s       med=0s      max=9.91ms   p(90)=0s      p(95)=0s      
     http_req_duration..............: avg=2.33ms  min=713.66µs med=2.01ms  max=260.73ms p(90)=3.6ms   p(95)=4.05ms  
     ✓ { expected_response:true }...: avg=2.33ms  min=713.66µs med=2.01ms  max=260.73ms p(90)=3.6ms   p(95)=4.05ms  
     http_req_failed................: 0.00%   ✓ 0          ✗ 4002 
     http_req_receiving.............: avg=48.97µs min=15µs     med=37.16µs max=1.64ms   p(90)=84.9µs  p(95)=113.74µs
     http_req_sending...............: avg=25.67µs min=3.79µs   med=19.08µs max=425.33µs p(90)=50.89µs p(95)=61.45µs 
     http_req_tls_handshaking.......: avg=0s      min=0s       med=0s      max=0s       p(90)=0s      p(95)=0s      
     http_req_waiting...............: avg=2.26ms  min=683.75µs med=1.94ms  max=260.69ms p(90)=3.5ms   p(95)=3.93ms  
     http_reqs......................: 4002    100.021623/s
     iteration_duration.............: avg=2.52ms  min=798.16µs med=2.15ms  max=260.84ms p(90)=3.91ms  p(95)=4.39ms  
     iterations.....................: 4001    99.99663/s
     status_2xx.....................: 3113    77.802927/s
   ✗ status_429.....................: 888     22.193704/s
   ✓ status_5xx.....................: 0       0/s
     vus............................: 1       min=0        max=2  
     vus_max........................: 100     min=100      max=100